<a href="https://colab.research.google.com/github/nurimammasri/Wooky-Pandas/blob/master/09.%20Merging%20DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Introduction**

`Menggabungkan data` adalah salah satu hal yang penting dalam suatu pekerjaan data analyst atau data science. karena dalam banyak kasus data selalu berada dri berbagai file dan sumber. Maka menguasai penggabungan data beserta logika-logika penggabungan data menjadi hal yang esensi untuk di kuasai.

Pandas menyediakan berbagai tool atau method yang memudahkan kita untuk melakukan penggabungan data dengan berbagai macam logika. method-method tersebut diantaranya seperti `join(), merge(), concat()`. kali ini kita kan mempelejari beberapa teknik tersebut.

Ada beberapa logika penggabungan data, diantaranya adalah :

* Inner Join

* Full Outer Join

* Left Outer Join

* Right Outer Join

* dll.

![merging_01.jpg](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_01.jpg)

`Series.append` : Concatenate Series.

`DataFrame.append` : Concatenate DataFrames.

`DataFrame.join` : Join DataFrames using indexes.

`DataFrame.merge` : Merge DataFrames by indexes or columns.


https://www.codepolitan.com/tujuh-teknik-join-di-sql-596c537f0deb3

# **Penggabungan Baris dan Column dengan Metod concat()**

Concat adalah salah satu metode untuk melakukan penggabungan data berdasarkan sumbu tertentu. langsung saja kita lihat.

```
pd.concat(objs: Union[('DataFrame'), ('Series')], axis=0, join='outer', ignore_index: bool=False, keys=None, levels=None, names=None, verify_integrity: bool=False, sort: bool=False, copy: bool=True) 
```

Parameters

..................

* `objs` : a sequence or mapping of Series or DataFrame objects

    If a dict is passed, the sorted keys will be used as the `keys` argument, unless it is passed, in which case the values will be selected (see below). Any None objects will be dropped silently unless they are all None in which case a ValueError will be raised.

* `axis` : {0/'index', 1/'columns'}, default 0

    The axis to concatenate along.

* `join` : {'inner', 'outer'}, default 'outer'

    How to handle indexes on other axis (or axes).

* `ignore_index` : bool, default False

    If True, do not use the index values along the concatenation axis. The resulting axis will be labeled 0, ..., n - 1. This is useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information. Note the index values on the other axes are still respected in the join.

* `keys` : sequence, default None

    If multiple levels passed, should contain tuples. Construct hierarchical index using the passed keys as the outermost level.

* `levels` : list of sequences, default None

    Specific levels (unique values) to use for constructing a MultiIndex. Otherwise they will be inferred from the keys.

* `names` : list, default None

  Names for the levels in the resulting hierarchical index.

* `verify_integrity` : bool, default False

    Check whether the new concatenated axis contains duplicates. This can be very expensive relative to the actual data concatenation.

* `sort` : bool, default False

    Sort non-concatenation axis if it is not already aligned when `join` is 'outer'. This has no effect when ``join='inner'``, which already preserves the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

    Changed to not sort by default.

* `copy` : bool, default True

    If False, do not copy data unnecessarily.

In [1]:
# pd.concat?

In [2]:
import pandas as pd

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                            'B': ['B0', 'B1', 'B2', 'B3'],
                            'C': ['C0', 'C1', 'C2', 'C3'],
                            'D': ['D0', 'D1', 'D2', 'D3']},
                           index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                            'B': ['B4', 'B5', 'B6', 'B7'],
                            'C': ['C4', 'C5', 'C6', 'C7'],
                            'D': ['D4', 'D5', 'D6', 'D7']},
                           index=[4, 5, 6, 7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                            'B': ['B8', 'B9', 'B10', 'B11'],
                            'C': ['C8', 'C9', 'C10', 'C11'],
                            'D': ['D8', 'D9', 'D10', 'D11']},
                           index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

![merging_02.jpg](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_02.jpg)

Perhatikan, data yang kita punya sangatlah simple, kita mempunyai 3 data yang mempunyai nama column yang sama. apabila kita ingin menggabungkan baris data ini, kita bisa menggunakan suatu method concat(). pertama kita buat terlebih dahulu list dari data yang akan kita gabung, kemudian masukan list tersebut sebagai argument kedalam method concat(). seperti ini.

In [5]:
# list data yang akan di gabung
list_dataframe = [df1, df2, df3]
# gabungkan data dengan metode concat dari pandas
pd.concat(list_dataframe)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

![merging_03.jpg](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_03.jpg)

Apabila kita ingin menggabungkan data tersebut berdasarkan column, kita mesti memberikan satu argument lagi kedalam method concat yaitu axis, dengan nilai 1. seperti ini

In [6]:
pd.concat(list_dataframe, axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Coba kalian perhatikan, penggabungan ini adalah penggabungan sumbu column pada setiap dataframe, dan pada sumbu baris di lakukan penggabungan juga berdasarkan indeks. secara default logika penggabunganya adalah outer join. kita akan melihat beberapa logika penggabungan setelah ini.

........................................................................................................................................................................................

In [7]:
# Combine two ``Series``.

s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [8]:
# Clear the existing index and reset it in the result by setting the ``ignore_index`` option to ``True
pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [9]:
# Add a hierarchical index at the outermost level of the data with the ``keys`` option.
pd.concat([s1, s2], keys=['s1', 's2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [10]:
# Label the index keys you create with the ``names`` option.
pd.concat([s1, s2], keys=['s1', 's2'], names=['Series name', 'Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [11]:
# Combine two ``DataFrame`` objects with identical columns.
df1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [12]:
df2 = pd.DataFrame([['c', 3], ['d', 4]], columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [13]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [14]:
# Combine ``DataFrame`` objects with overlapping columns
# and return everything. Columns outside the intersection will
# be filled with ``NaN`` values.

df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']], columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [15]:
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [16]:
# Combine ``DataFrame`` objects with overlapping columns
# and return only those that are shared by passing ``inner`` to
# the ``join`` keyword argument.
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [17]:
# Combine ``DataFrame`` objects horizontally along the x axis by
# passing in ``axis=1``.
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']], columns=['animal', 'name'])
pd.concat([df1, df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [18]:
# Prevent the result from including duplicate index values with the
# ``verify_integrity`` option.

df5 = pd.DataFrame([1], index=['a'])
df5

   0
a  1

In [19]:
df6 = pd.DataFrame([2], index=['a'])
df6

   0
a  2

In [20]:
# pd.concat([df5, df6], verify_integrity=True)
# Error : Indexes have overlapping values: Index(['a'], dtype='object')

# **Logika-Logika Penggabungan Dengan Metode merge()**

`pd.merge(left, right, how: str='inner', on=None, left_on=None, right_on=None, left_index: bool=False, right_index: bool=False, sort: bool=False, suffixes=('_x', '_y'), copy: bool=True, indicator: bool=False, validate=None)`

Parameters

........................

* `left` : DataFrame
* `right` : DataFrame or named Series

    Object to merge with.

* `how` : {'left', 'right', 'outer', 'inner'}, default 'inner'

    Type of merge to be performed.

    * `left`: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * `right`: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * `outer`: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * `inner`: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.

* `on` : label or list

    Column or index level names to join on. These must be found in both DataFrames. If `on` is None and not merging on indexes then this defaults to the intersection of the columns in both DataFrames.

* `left_on` : label or list, or array-like

    Column or index level names to join on in the left DataFrame. Can also be an array or list of arrays of the length of the left DataFrame. These arrays are treated as if they are columns.

* `right_on` : label or list, or array-like

    Column or index level names to join on in the right DataFrame. Can also be an array or list of arrays of the length of the right DataFrame. These arrays are treated as if they are columns.

* `left_index` : bool, default False

    Use the index from the left DataFrame as the join key(s). If it is a MultiIndex, the number of keys in the other DataFrame (either the index or a number of columns) must match the number of levels.

* `right_index` : bool, default False

    Use the index from the right DataFrame as the join key. Same caveats as left_index.

* `sort` : bool, default False

    Sort the join keys lexicographically in the result DataFrame. If False, the order of the join keys depends on the join type (how keyword).

* `suffixes` : tuple of (str, str), default ('_x', '_y')

    Suffix to apply to overlapping column names in the left and right side, respectively. To raise an exception on overlapping columns use (False, False).

* `copy` : bool, default True

    If False, avoid copy if possible.

* `indicator` : bool or str, default False

    If True, adds a column to output DataFrame called "_merge" with information on the source of each row.

    If string, column with information on source of each row will be added to output DataFrame, and column will be named value of string.

    Information column is Categorical-type and takes on a value of "left_only" for observations whose merge key only appears in 'left' DataFrame, "right_only" for observations whose merge key only appears in 'right' DataFrame, and "both" if the observation's merge key is found in both.

* `validate` : str, optional

    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

    .. versionadded:: 0.21.0

In [21]:
pd.merge?

In [22]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                     'value': [1, 2, 3, 5]})
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [23]:
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [24]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [25]:
# Merge DataFrames df1 and df2 with specified left and right suffixes
# appended to any overlapping columns.

df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

In [26]:
# Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
# any overlapping columns.

# df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))

# columns overlap but no suffix specified: Index(['value'], dtype='object')

## **Full Outer Join**
![full_outer_join.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/full_outer_join.png)

* Full Outer Join menghasilkan gabungan index baris dari setiap data yang di gabung.
* Full Outer Join menggabungan pula column yang berbeda
* Memberikan nilai null untuk nilai column yang tidak di miliki oleh suatu index tertentu.

In [27]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                              'A': ['A0', 'A1', 'A2', 'A3'],
                              'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K4', 'K5'],
                                 'C': ['C0', 'C1', 'C2', 'C3'],
                                 'D': ['D0', 'D1', 'D2', 'D3']})

print('data pertama')
print('=========')
print(left)
print('data kedua')
print('=========')
print(right)

data pertama
=========
  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
data kedua
=========
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K4  C2  D2
3  K5  C3  D3

Kita akan menggabungkan data ini dengan menggunakan method merge() dari pandas. dalam penggabungan kita kan gunakan column 'key' dari data kita sebagai variabel identifier dari data kita, atau sebagai column key/referensi.

* Untuk melakukan penggabungan dengan menggunakan column key sebagai referensi penggabungan, maka kita akan memberikan argument `on` dengan nilai `key`
* untuk melakukan penggabungan outer join kita akan memberikan argument `how` dengan nilai `outer`

In [28]:
# gabungkan data dengan logika outer join
pd.merge(left, right, on='key', how='outer')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
4  K4  NaN  NaN   C2   D2
5  K5  NaN  NaN   C3   D3

## **Inner Join**

![inner_join.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/inner_join.png)

Inner join ini akan menggabungkan data antara nilai key/referensi yang beririsan.

Kita akan mencoba melakukan inner join dengan data yang sama pada outer join, Untuk melakukan inner join dengan metode merge(), kurang lebih sama seperti yang di lakukan pada outer join, kita hanya perlu mengubah argument argument how menjadi inner.

In [29]:
pd.merge(left, right, on='key', how='inner')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1

## **Left Join**

![left_outer_join.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/left_outer_join.png)

Left Outer Join menghasilkan seluruh data dari data yang kiri ditambah data kanan yang memiliki nilai key yang sama dengan data dari kiri.

Kita akan mencoba melakukan left outer join dengan data yang sama pada outer join, untuk melakukan left outer join kita hanya perlu memberikan nilai ‘left’ kepada argument how.

In [30]:
pd.merge(left, right, on='key', how='left')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3  NaN  NaN

## **Right Join**

Right outer join ini hanya kebalikan dari left outer join.

Untuk melakukan operasi penggabungan right outer join dengan metode merge, kita hanya perlu memberikan nilai ‘right’ pada argument how.

In [31]:
pd.merge(left, right, on='key', how='right')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K4  NaN  NaN  C2  D2
3  K5  NaN  NaN  C3  D3

# **Logika-Logika Penggabungan Dengan Metode merge 02**

![merging_04.jpg](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_04.jpg)

In [32]:
import numpy as np
np.random.seed(0)
left = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': np.random.randn(4)})    
right = pd.DataFrame({'key': ['B', 'D', 'E', 'F'], 'value': np.random.randn(4)})

In [33]:
left

  key     value
0   A  1.764052
1   B  0.400157
2   C  0.978738
3   D  2.240893

In [34]:
right

  key     value
0   B  1.867558
1   D -0.977278
2   E  0.950088
3   F -0.151357

## **Inner Join**

![inner_join02.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/inner_join02.png)

In [35]:
pd.merge(left, right, on='key')

  key   value_x   value_y
0   B  0.400157  1.867558
1   D  2.240893 -0.977278

Dalam versi panda yang lebih baru (v0.21 atau lebih),`merge` sekarang menjadi fungsi urutan pertama, sehingga Anda dapat memanggil `DataFrame.merge` .

In [36]:
left.merge(right, on='key')
# Or, if you want to be explicit
# left.merge(right, on='key', how='inner')

  key   value_x   value_y
0   B  0.400157  1.867558
1   D  2.240893 -0.977278

## **Left Outer Join / Left Join**

![left_outer_join02.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/left_outer_join02.png)

In [37]:
left.merge(right, on='key', how='left')

  key   value_x   value_y
0   A  1.764052       NaN
1   B  0.400157  1.867558
2   C  0.978738       NaN
3   D  2.240893 -0.977278

## **Right Outer Join / Right Join**

![right_outer_join.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/right_outer_join.png)

In [38]:
left.merge(right, on='key', how='right')

  key   value_x   value_y
0   B  0.400157  1.867558
1   D  2.240893 -0.977278
2   E       NaN  0.950088
3   F       NaN -0.151357

## **Full Outer Join**

![full_outer_join02.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/full_outer_join02.png)

In [39]:
left.merge(right, on='key', how='outer')

  key   value_x   value_y
0   A  1.764052       NaN
1   B  0.400157  1.867558
2   C  0.978738       NaN
3   D  2.240893 -0.977278
4   E       NaN  0.950088
5   F       NaN -0.151357

## **Left Only**

![left_only.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/left_only.png)

In [40]:
# left.merge(right, on='key', how='left', indicator=True).query('_merge == "left_only"').drop('_merge', 1)
(left.merge(right, on='key', how='left', indicator=True)
     .query('_merge == "left_only"')
     .drop('_merge', 1))

  key   value_x  value_y
0   A  1.764052      NaN
2   C  0.978738      NaN

Where

In [41]:
left.merge(right, on='key', how='left', indicator=True)

  key   value_x   value_y     _merge
0   A  1.764052       NaN  left_only
1   B  0.400157  1.867558       both
2   C  0.978738       NaN  left_only
3   D  2.240893 -0.977278       both

## **Right Only**

![right_only.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/right_only.png)

In [42]:
(left.merge(right, on='key', how='right', indicator=True)
     .query('_merge == "right_only"')
     .drop('_merge', 1))

  key  value_x   value_y
2   E      NaN  0.950088
3   F      NaN -0.151357

In [43]:
left.merge(right, on='key', how='right', indicator=True)

  key   value_x   value_y      _merge
0   B  0.400157  1.867558        both
1   D  2.240893 -0.977278        both
2   E       NaN  0.950088  right_only
3   F       NaN -0.151357  right_only

## **Left Only U Right Only**

![left_only_right_only.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/left_only_right_only.png)

In [44]:
(left.merge(right, on='key', how='outer', indicator=True)
     .query('_merge != "both"')
     .drop('_merge', 1))

  key   value_x   value_y
0   A  1.764052       NaN
2   C  0.978738       NaN
4   E       NaN  0.950088
5   F       NaN -0.151357

In [45]:
left.merge(right, on='key', how='outer', indicator=True)

  key   value_x   value_y      _merge
0   A  1.764052       NaN   left_only
1   B  0.400157  1.867558        both
2   C  0.978738       NaN   left_only
3   D  2.240893 -0.977278        both
4   E       NaN  0.950088  right_only
5   F       NaN -0.151357  right_only

# **Nama berbeda untuk kolom kunci**

In [46]:
import numpy as np
np.random.seed(0)
left = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': np.random.randn(4)})    
right = pd.DataFrame({'key': ['B', 'D', 'E', 'F'], 'value': np.random.randn(4)})

left2 = left.rename({'key':'keyLeft'}, axis=1)
right2 = right.rename({'key':'keyRight'}, axis=1)

In [47]:
left2

  keyLeft     value
0       A  1.764052
1       B  0.400157
2       C  0.978738
3       D  2.240893

In [48]:
right2

  keyRight     value
0        B  1.867558
1        D -0.977278
2        E  0.950088
3        F -0.151357

In [49]:
left2.merge(right2, left_on='keyLeft', right_on='keyRight', how='inner')

  keyLeft   value_x keyRight   value_y
0       B  0.400157        B  1.867558
1       D  2.240893        D -0.977278

# **Menghindari kolom kunci duplikat dalam output**

In [50]:
import numpy as np
np.random.seed(0)
left = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': np.random.randn(4)})    
right = pd.DataFrame({'key': ['B', 'D', 'E', 'F'], 'value': np.random.randn(4)})

left2 = left.rename({'key':'keyLeft'}, axis=1)
right2 = right.rename({'key':'keyRight'}, axis=1)

In [51]:
left2

  keyLeft     value
0       A  1.764052
1       B  0.400157
2       C  0.978738
3       D  2.240893

In [52]:
left3 = left2.set_index('keyLeft')
left3

            value
keyLeft
A        1.764052
B        0.400157
C        0.978738
D        2.240893

In [53]:
right2

  keyRight     value
0        B  1.867558
1        D -0.977278
2        E  0.950088
3        F -0.151357

In [54]:
left3.merge(right2, left_index=True, right_on='keyRight')

    value_x keyRight   value_y
0  0.400157        B  1.867558
1  2.240893        D -0.977278

# **Menggabungkan hanya satu kolom dari salah satu DataFrames**

In [55]:
import numpy as np
np.random.seed(0)
left = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': np.random.randn(4)})    
right = pd.DataFrame({'key': ['B', 'D', 'E', 'F'], 'value': np.random.randn(4)})

left2 = left.rename({'key':'keyLeft'}, axis=1)
right2 = right.rename({'key':'keyRight'}, axis=1)

In [56]:
right

  key     value
0   B  1.867558
1   D -0.977278
2   E  0.950088
3   F -0.151357

In [57]:
right3 = right.assign(newcol=np.arange(len(right)))
right3

  key     value  newcol
0   B  1.867558       0
1   D -0.977278       1
2   E  0.950088       2
3   F -0.151357       3

In [58]:
left.merge(right3[['key', 'newcol']], on='key')

  key     value  newcol
0   B  0.400157       0
1   D  2.240893       1

In [59]:
left.merge(right3[['key', 'newcol']], on='key', how='left')

  key     value  newcol
0   A  1.764052     NaN
1   B  0.400157     0.0
2   C  0.978738     NaN
3   D  2.240893     1.0

# **Menggabungkan beberapa kolom**

`left.merge(right, on=['key1', 'key2'] ...)`

Atau, jika namanya berbeda,

`left.merge(right, left_on=['lkey1', 'lkey2'], right_on=['rkey1', 'rkey2'])`

# **Generalisasi: mergeing beberapa DataFrames**

In [60]:
np.random.seed(0)
A = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'valueA': np.random.randn(4)})    
B = pd.DataFrame({'key': ['B', 'D', 'E', 'F'], 'valueB': np.random.randn(4)})
C = pd.DataFrame({'key': ['D', 'E', 'J', 'C'], 'valueC': np.ones(4)})

In [61]:
A

  key    valueA
0   A  1.764052
1   B  0.400157
2   C  0.978738
3   D  2.240893

In [62]:
B

  key    valueB
0   B  1.867558
1   D -0.977278
2   E  0.950088
3   F -0.151357

In [63]:
C

  key  valueC
0   D     1.0
1   E     1.0
2   J     1.0
3   C     1.0

## Inner Join

In [64]:
A.merge(B, on='key').merge(C, on='key')

  key    valueA    valueB  valueC
0   D  2.240893 -0.977278     1.0

In [65]:
dfs = [A, B, C]

In [66]:
from functools import reduce
reduce(pd.merge, dfs)

  key    valueA    valueB  valueC
0   D  2.240893 -0.977278     1.0

## Outer Join

In [67]:
from functools import partial
outer_merge = partial(pd.merge, how='outer')
reduce(outer_merge, dfs)

  key    valueA    valueB  valueC
0   A  1.764052       NaN     NaN
1   B  0.400157  1.867558     NaN
2   C  0.978738       NaN     1.0
3   D  2.240893 -0.977278     1.0
4   E       NaN  0.950088     1.0
5   F       NaN -0.151357     NaN
6   J       NaN       NaN     1.0

Seperti yang mungkin telah Anda perhatikan, ini cukup kuat — Anda juga dapat menggunakannya untuk mengontrol nama kolom selama penggabungan. Cukup tambahkan lebih banyak argumen kata kunci sesuai kebutuhan:

`partial(pd.merge, how='outer', left_index=True, right_on=...)`

Alternatifnya: `pd.concat`

Jika nilai kolom Anda unik, maka masuk akal untuk menggunakan pd.concat, ini lebih cepat daripada gabungan dua arah dua kali.

In [68]:
pd.concat([
    df.set_index('key') for df in dfs], axis=1, join='inner'
).reset_index()

  key    valueA    valueB  valueC
0   D  2.240893 -0.977278     1.0

# **Multiway bergabung pada indeks unik**

Jika Anda menggabungkan beberapa DataFrames pada indeks unik, Anda harus sekali lagi memilih pd.concat untuk kinerja yang lebih baik.

In [69]:
# Note, the "key" column values are unique, so the index is unique.
A2 = A.set_index('key')
B2 = B.set_index('key')
C2 = C.set_index('key')
dfs2 = [A2, B2, C2]
pd.concat(dfs2, axis=1, sort=False, join='inner')

       valueA    valueB  valueC
key
D    2.240893 -0.977278     1.0

# **Multiway menggabungkan indeks dengan duplikat**

concat cepat, tetapi memiliki kekurangannya. Itu tidak bisa menangani duplikat.

In [70]:
A3 = pd.DataFrame({'key': ['A', 'B', 'C', 'D', 'D'], 'valueA': np.random.randn(5)})
# pd.concat([df.set_index('key') for df in [A3, B, C]], axis=1, join='inner')
# ValueError: Shape of passed values is (3, 4), indices imply (3, 2)

Dalam situasi ini, join adalah pilihan terbaik, karena dapat menangani indeks yang tidak unik (join memanggil merge di bawah tenda).

In [71]:
# For inner join. For left join, pass `pd.DataFrame.join` directly to `reduce`. 
inner_join = partial(pd.DataFrame.join, how='inner')
reduce(inner_join, [A3.set_index('key'), B2, C2])

       valueA    valueB  valueC
key
D    1.454274 -0.977278     1.0
D    0.761038 -0.977278     1.0

# **Task**

## **Example 1**

In [72]:
# Dummy Data 1

dummy_data1 = {
    'id':['1', '2', '3', '4', '5'],
    'Feature1':['A', 'C', 'E', 'G', 'I'], 
    'Feature2':['B', 'D', 'F', 'H', 'J']
}

df1 = pd.DataFrame(dummy_data1, columns = ['id', 'Feature1', 'Feature2'])
df1

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J

In [73]:
# Dummy Data 2

dummy_data2 = {
    'id':['1', '2', '6', '7', '8'],
    'Feature1':['K', 'M', 'O', 'Q', 'S'], 
    'Feature2':['L', 'N', 'P', 'R', 'T']
}

df2 = pd.DataFrame(dummy_data2, columns = ['id', 'Feature1', 'Feature2'])
df2

  id Feature1 Feature2
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T

In [74]:
# Dummy Data 3

dummy_data3 = {
    'id':['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
    'Feature3':[12, 13, 14, 15, 16, 17, 15, 12, 13, 23]
}

df3 = pd.DataFrame(dummy_data3, columns = ['id', 'Feature3'])
df3

   id  Feature3
0   1        12
1   2        13
2   3        14
3   4        15
4   5        16
5   7        17
6   8        15
7   9        12
8  10        13
9  11        23

In [75]:
# Menggabungkan Data 1 dan Data 2 menggunakan concat pada row
df_list = [df1 , df2]
pd.concat(df_list)

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T

In [76]:
pd.concat(df_list, ignore_index=True)

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J
5  1        K        L
6  2        M        N
7  6        O        P
8  7        Q        R
9  8        S        T

In [77]:
# menggabungkan data pada column
pd.concat(df_list, axis=1, ) # default axis = 0

  id Feature1 Feature2 id Feature1 Feature2
0  1        A        B  1        K        L
1  2        C        D  2        M        N
2  3        E        F  6        O        P
3  4        G        H  7        Q        R
4  5        I        J  8        S        T

In [78]:
# menggabungkan data pada column
pd.concat(df_list, ignore_index=True, axis=1) # default axis = 0

   0  1  2  3  4  5
0  1  A  B  1  K  L
1  2  C  D  2  M  N
2  3  E  F  6  O  P
3  4  G  H  7  Q  R
4  5  I  J  8  S  T

In [79]:
# Menggabungkan Data 1 dan Data 2 menggunakan concat pada row
df_list = [df1 , df2]
df12 = pd.concat(df_list)
df12

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T

In [80]:
df3

   id  Feature3
0   1        12
1   2        13
2   3        14
3   4        15
4   5        16
5   7        17
6   8        15
7   9        12
8  10        13
9  11        23

In [81]:
pd.merge(df12, df3, on='id')

  id Feature1 Feature2  Feature3
0  1        A        B        12
1  1        K        L        12
2  2        C        D        13
3  2        M        N        13
4  3        E        F        14
5  4        G        H        15
6  5        I        J        16
7  7        Q        R        17
8  8        S        T        15

In [82]:
df3.columns = ['idkey', 'Feature3']
pd.merge(df12, df3, left_on='id', right_on='idkey')

  id Feature1 Feature2 idkey  Feature3
0  1        A        B     1        12
1  1        K        L     1        12
2  2        C        D     2        13
3  2        M        N     2        13
4  3        E        F     3        14
5  4        G        H     4        15
6  5        I        J     5        16
7  7        Q        R     7        17
8  8        S        T     8        15

## **Example 2**

<h2>Soal 1: Penggabungan Data</h2>

- Sebutkan perbedaan antara full outer join, inner join, dan left join

Jawab:


Pada Outer Join, nilai dari left dan right data akan digabungkan tapi akan menghasilkan Nilai NaN untuk bagian kepemilikan selain both yakni yang dimiliki keduanya.

Pada Inner Join dapat dikatakan Intersect untuk left dan right data, maka yang akan value hasil dari fungsi ini adalah hanya both yakni yang dimiliki keduanya.

Pada Left Join, akan menggabungkan data pada left data dan intersect atau both dari keduanya.

<h2>Soal 2: Penggabungan Data</h2>

Pada quiz no 2 ini gunakan data 

Drive

[names1881.csv](https://drive.google.com/uc?export=download&id=1Pwu3cv93hI79jmi52kJ05xhophknDKat) dan [names1981.csv](https://drive.google.com/uc?export=download&id=1pvsGaybr423hJXcN35e5nS3sg4ha4jo3),

Github

[names1881.csv](https://github.com/nurimammasri/Wooky-Pandas/blob/master/Data/names1881.csv) dan [names1981.csv](https://github.com/nurimammasri/Wooky-Pandas/blob/master/Data/names1981.csv),

data ini berisi nama bayi yang lahir pada tahun 1881 atau 1981 di Amerika.

- Baca data tersebut dengan memberikan nama column 'Name', 'Gender', 'Count'.
- Tunjukan jumlah dimensi dari data 'names1881.csv' dan 'names1981.csv'
- Gabungkan kedua data tersebut berdasarkan sumbu baris
- Tunjukan jumlah dimensi dari data setelah di gabungkan.

In [83]:
# import pandas as pd
# read data
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/names1881.csv'
# df1 = pd.read_csv('https://drive.google.com/uc?id=1YIXkct-IhPdUONkZKKmsS5jHY9NGJ3kj', names=['Name', 'Gender', 'Count'])
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/names1981.csv'
# df2 = pd.read_csv('https://drive.google.com/uc?id=1T5qJGVvsxWBRlI1nC9bfwmF7IiyKVZ62', names=['Name', 'Gender', 'Count'])

In [84]:
import pandas as pd
# read data
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/names1881.csv'
df1 = pd.read_csv('https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Data/names1881.csv', names=['Name', 'Gender', 'Count'])
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/names1981.csv'
df2 = pd.read_csv('https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Data/names1981.csv', names=['Name', 'Gender', 'Count'])

In [85]:
# periksa dimensi dari kedua data
print("Jumlah Dimensi data 'names1881.csv' :")
print(df1.shape)

# gabungkan data
print("Jumlah Baris data 'names1981.csv' :")
print(df2.shape)

df = pd.concat([df1,df2])
display(df)

# periksa dimensi data hasil gabungan
print("Jumlah dimensi data setelah penggabungan : ")
print(df2.shape)

Jumlah Dimensi data 'names1881.csv' :
(1935, 3)
Jumlah Baris data 'names1981.csv' :
(19455, 3)

            Name Gender  Count
0           Mary      F   6919
1           Anna      F   2698
2           Emma      F   2034
3      Elizabeth      F   1852
4       Margaret      F   1658
...          ...    ...    ...
19450   Zeferino      M      5
19451    Zerrick      M      5
19452   Zimbabwe      M      5
19453     Zoltan      M      5
19454     Zuriel      M      5

[21390 rows x 3 columns]

Jumlah dimensi data setelah penggabungan :
(19455, 3)

Expected Result: 

Jumlah Dimensi data 'names1881.csv': 

(1935, 3)

Jumlah Baris data 'names1981.csv':

(19455, 3)

![merging_task_01.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_task_01.png)

Jumlah dimensi data setelah penggabungan : 

(21390, 3)

<h2>Soal 3: Penggabungan Data</h2>

Lakukan jenis penggabungan data full outer join, inner join, left outer join dan right outer join pada kedua data berikut:

In [86]:
import pandas as pd

data1 = {
    'id' : [1, 2, 3, 4],
    'Feature1' : ['a1', 'a2', 'a3', 'a4'],
    'Feature2' : ['b1', 'b2', 'b3', 'b4']
}

data2 = {
    'id' : [3, 4, 5 ,6, 7],
    'Feature3' : ['c1', 'c2', 'c3', 'c4', 'c5']
}

df1= pd.DataFrame(data1)
df2= pd.DataFrame(data2)

print(df1, end='\n\n')
print(df2)

   id Feature1 Feature2
0   1       a1       b1
1   2       a2       b2
2   3       a3       b3
3   4       a4       b4

   id Feature3
0   3       c1
1   4       c2
2   5       c3
3   6       c4
4   7       c5

In [87]:
# join data
df_outer_join = pd.merge(df1, df2, on='id', how='outer')
print(df_outer_join, end='\n\n')

df_inner_join = pd.merge(df1, df2, on='id', how='inner')
print(df_inner_join, end='\n\n')

df_left_join = pd.merge(df1, df2, on='id', how='left')
print(df_left_join, end='\n\n')

df_right_join = pd.merge(df1, df2, on='id', how='right')
print(df_right_join, end='\n\n')

   id Feature1 Feature2 Feature3
0   1       a1       b1      NaN
1   2       a2       b2      NaN
2   3       a3       b3       c1
3   4       a4       b4       c2
4   5      NaN      NaN       c3
5   6      NaN      NaN       c4
6   7      NaN      NaN       c5

   id Feature1 Feature2 Feature3
0   3       a3       b3       c1
1   4       a4       b4       c2

   id Feature1 Feature2 Feature3
0   1       a1       b1      NaN
1   2       a2       b2      NaN
2   3       a3       b3       c1
3   4       a4       b4       c2

   id Feature1 Feature2 Feature3
0   3       a3       b3       c1
1   4       a4       b4       c2
2   5      NaN      NaN       c3
3   6      NaN      NaN       c4
4   7      NaN      NaN       c5

Expected Result:

![merging_task_02.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_task_02.png)

![merging_task_03.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_task_03.png)

![merging_task_04.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_task_04.png)

![merging_task_05.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_task_05.png)

<h2>Soal 4: Penggabungan Data berbeda label column Key</h2>

Lakukan jenis penggabungan inner join untuk 2 data yang memiliki nama column key yang berbeda ini:

In [88]:
data1 = {
    'key_data1' : [1, 2, 3, 4],
    'Feature1' : ['a1', 'a2', 'a3', 'a4'],
    'Feature2' : ['b1', 'b2', 'b3', 'b4']
}

data2 = {
    'key_data2' : [3, 4, 5 ,6, 7],
    'Feature3' : ['c1', 'c2', 'c3', 'c4', 'c5']
}

df1= pd.DataFrame(data1)
df2= pd.DataFrame(data2)

print(df1, end='\n\n')
print(df2, end='\n\n')

   key_data1 Feature1 Feature2
0          1       a1       b1
1          2       a2       b2
2          3       a3       b3
3          4       a4       b4

   key_data2 Feature3
0          3       c1
1          4       c2
2          5       c3
3          6       c4
4          7       c5

In [89]:
# Gabungkan kedua data tersebut
df_gabung = pd.merge(df1, df2, left_on='key_data1', right_on='key_data2', how='inner')
df_gabung

   key_data1 Feature1 Feature2  key_data2 Feature3
0          3       a3       b3          3       c1
1          4       a4       b4          4       c2

Expected Result:

![merging_task_06.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/merging_task_06.png)

# **Append**

# **Join**